IDENTIFICATION DIVISION.
PROGRAM-ID. COBCLM01.

ENVIRONMENT DIVISION.
FILE-CONTROL.
 SELECT CLM-IN ASSIGN TO DDIN.
 SELECT POL-VSAM ASSIGN TO POLICY
   ORGANIZATION IS INDEXED
   RECORD KEY IS POL-NO.
 SELECT CLM-REJ ASSIGN TO DDREJ.

DATA DIVISION.
FILE SECTION.
FD CLM-IN.
01 CLM-IN-REC.
   05 CLAIM-ID  PIC X(10).
   05 POLICY-NO PIC X(10).
   05 CLAIM-AMT PIC 9(7)V99.

FD POL-VSAM.
01 POL-REC.
   05 POL-NO PIC X(10).
   05 FILLER PIC X(70).

FD CLM-REJ.
01 CLM-REJ-REC PIC X(80).

WORKING-STORAGE SECTION.
01 WS-STATUS PIC X.
EXEC SQL INCLUDE SQLCA END-EXEC.
EXEC SQL INCLUDE CLAIMH END-EXEC.

PROCEDURE DIVISION.
 OPEN INPUT CLM-IN I-O POL-VSAM OUTPUT CLM-REJ

 PERFORM UNTIL FALSE
   READ CLM-IN AT END EXIT PERFORM
   READ POL-VSAM
     INVALID KEY
       MOVE 'R' TO WS-STATUS
       WRITE CLM-REJ-REC FROM CLM-IN-REC
     NOT INVALID KEY
       MOVE 'A' TO WS-STATUS
   END-READ

   EXEC SQL
     INSERT INTO CLAIM_HISTORY
     VALUES (:CLAIM-ID,:POLICY-NO,:CLAIM-AMT,
             CURRENT DATE,:WS-STATUS)
   END-EXEC
 END-PERFORM

 EXEC SQL COMMIT END-EXEC
 CLOSE CLM-IN POL-VSAM CLM-REJ
 STOP RUN.
