IDENTIFICATION DIVISION.
PROGRAM-ID. COBUPD01.

DATA DIVISION.
WORKING-STORAGE SECTION.
EXEC SQL INCLUDE SQLCA END-EXEC.

PROCEDURE DIVISION.
 EXEC SQL
   UPDATE POLICY_TABLE P
      SET SUM_ASSURED =
          SUM_ASSURED -
          (SELECT SUM(CLAIM_AMOUNT)
             FROM CLAIM_HISTORY C
            WHERE C.POLICY_NO = P.POLICY_NO
              AND C.STATUS = 'A')
 END-EXEC

 IF SQLCODE = 0
   EXEC SQL COMMIT END-EXEC
 ELSE
   EXEC SQL ROLLBACK END-EXEC
 END-IF

 STOP RUN.
