//JOBCLM01 JOB (ACCT),'CLAIM PROCESS',CLASS=A,MSGCLASS=X
//STEP1 EXEC PGM=COBCLM01
//STEPLIB DD DSN=USER.COBOL.LOADLIB,DISP=SHR
//DDIN    DD DSN=CLAIM.INPUT.PS,DISP=SHR
//POLICY  DD DSN=POLICY.MASTER.KSDS,DISP=SHR
//DDREJ   DD DSN=CLAIM.REJECT.PS,
//           DISP=(NEW,CATLG,DELETE),
//           SPACE=(TRK,(5,5)),
//           DCB=(RECFM=FB,LRECL=80)
//SYSOUT  DD SYSOUT=*
//DBRMLIB DD DSN=USER.COBOL.DBRMLIB,DISP=SHR
